change ansi diagrams to mermaid diagrams
